/*
*********************************************************************************************************
*
*	模块名称 : TSC2046电阻触摸芯片驱动程序
*	文件名称 : bsp_tsc2046.h
*	版    本 : V1.0
*	说    明 : 头文件
*
*	Copyright (C), 2014-2015, 安富莱电子 www.armfly.com
*
*********************************************************************************************************
*/

#ifndef _BSP_TSC2046_H
#define _BSP_TSC2046_H

void TSC2046_InitHard(void);
uint16_t TSC2046_ReadAdc(uint8_t _ucCh);
uint8_t TSC2046_PenInt(void);

#endif
